Autodesk.Revit.DB.NumberSystem.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.LinkElementId,Autodesk.Revit.DB.Architecture.StairsNumberSystemReferenceOption,Autodesk.Revit.DB.LinkElementId)
Creates a new instance of a NumberSystem associated to a host element, a view, and a reference level of stairs if in a multistory stairs.
Remarks:
In multistory stairs, a stairs element could be a stair group or individual stair.
This method allows to add a NumberSystem for a run of an individual stairs or a stairs group member on the placementLevelId.
document:
The document.
viewId:
The view in which the NumberSystem will be created.
hostElementId:
The host id on which the NumberSystem will be created.
referenceOption:
The reference option of the NumberSystem.
placementLevelId:
The id of the level on which the NumberSystem will be placed. The placement level must be one of the base levels of a stairs group members. It is suggested to
get the level from MultistoryStairs.GetStairsPlacementLevels().
Returns:
The created NumberSystem.
Throws Autodesk.Revit.Exceptions.ArgumentException:
viewId is not valid for placement of a NumberSystem (only floor plan views and elevation views are permitted).
-or-
hostElementId is not valid as a host for NumberSystem (only StairsRun elements are permitted in this release).
-or-
The reference option is not valid for a NumberSystem.
-or-
The placementLevelId is not one of the stairs base levels, or is higher than the elevation of viewId.
-or-
The hostElementId already has a number system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2018